cases/2D/discSteadyUniformFlow/triangleMesh/deltaX0.04/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.cyclohexane.*"
    {
        advectionScheme isoAdvection;
        reconstructionScheme plicRDF; //RDFadvect isoInverseDistance

        // isoAdvector parameters
        isoFaceTol      1e-8;
        surfCellTol     1e-8;
        nAlphaBounds    3;
        // Henning: sometimes bubble form near the sym axis due to errors in the conti equations
        // lowering the snaptol should mitigate this problem but the might be a minor effect on
        // the mass conservation but it can be neglected
        snapTol         1e-12;
        clip            true;
        gradAlphaNormal false;
        //reconstructionScheme isoAlpha;

        // MULES parameters
        nAlphaCorr      2;
        cAlpha          1;
        icAlpha         0;
        MULESCorr       yes;
        nLimiterIter    3;
        alphaApplyPrevCorr yes;
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
        minIter         1;

        // parameters read by both isoAdvector and MULES
        nAlphaSubCycles 1;
    }

    pcorr
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-10;
        relTol          0;
        cacheAgglomeration no;
    }

    pcorrFinal
    {
        $pcorr;
        cacheAgglomeration no;
        relTol          0;
    }

    p_rgh
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-07;
        cacheAgglomeration no;
        relTol          0.001;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance       1e-8; /* Should be 1 to 2 orders of
                                 magnitude smaller than
                                 alpha.water.*.surfCellTol */
        cacheAgglomeration no;
        relTol          0;
    }

    "(U|k|epsilon).*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0;
    }

    "CLVEthylene"
    {
        // solver          PCG;
        // solver          PBiCG;
        solver          GAMG;
        // preconditioner  DILU;
        smoother  GaussSeidel;
        tolerance       1e-6;
        relTol          0;
        residualAlpha   1e-10;
    }

    "CLVLEthylene"
    {
        // solver          PCG;
        // solver          PBiCG;
        solver          GAMG;
        // preconditioner  DILU;
        smoother  GaussSeidel;
        tolerance       1e-6;
        relTol          0;
        residualAlpha   1e-10;
    }

    "CLVButene"
    {
        solver          PCG;
        // solver          PBiCG;
        // solver          GAMG;
        preconditioner  DIC;
        // smoother  DILU;
        tolerance       1e-6;
        relTol          0;
        residualAlpha   1e-10;
    }

    "CLVLButene"
    {
        solver          PCG;
        // solver          PBiCG;
        // solver          GAMG;
        preconditioner  DIC;
        // smoother  DILU;
        tolerance       1e-6;
        relTol          0;
        residualAlpha   1e-10;
    }

    "CLVCyclohexane"
    {
        solver          PCG;
        // solver          PBiCG;
        // solver          GAMG;
        preconditioner  DIC;
        // smoother  DILU;
        tolerance       1e-6;
        relTol          0;
        residualAlpha   1e-10;
    }

    "CLVLCyclohexane"
    {
        solver          PCG;
        // solver          PBiCG;
        // solver          GAMG;
        preconditioner  DIC;
        // smoother  DILU;
        tolerance       1e-6;
        relTol          0;
        residualAlpha   1e-10;
    }

    "CLVEthyleneFinal"
    {
        $CLVEthylene
        tolerance       1e-8;
        relTol          0;
    }

    "CLVCyclohexaneFinal"
    {
        $CLVCyclohexane
        tolerance       1e-8;
        relTol          0;
    }

    "CLVButeneFinal"
    {
        $CLVButene
        tolerance       1e-8;
        relTol          0;
    }

    "CLVLEthyleneFinal"
    {
        $CLVLEthylene
        tolerance       1e-8;
        relTol          0;
    }

    "CLVLCyclohexaneFinal"
    {
        $CLVLCyclohexane
        tolerance       1e-8;
        relTol          0;
    }

    "CLVLButeneFinal"
    {
        $CLVLButene
        tolerance       1e-8;
        relTol          0;
    }
    
    "CGV*"
    {
        solver          PCG;
        advectionScheme isoAdvection;
        preconditioner  DIC;
        tolerance       1e-6;
        relTol          0;
        residualAlpha   1e-10;
    }

    "CGVEthyleneFinal"
    {
        $CGV
        tolerance       1e-8;
        relTol          0;
    }

    "CGVCyclohexaneFinal"
    {
        $CGV
        tolerance       1e-8;
        relTol          0;
    }
    
    "CGVButeneFinal"
    {
        $CGV
        tolerance       1e-8;
        relTol          0;
    }

    "CGVGEthyleneFinal"
    {
        $CGV
        tolerance       1e-8;
        relTol          0;
    }

    "CGVGCyclohexaneFinal"
    {
        $CGV
        tolerance       1e-8;
        relTol          0;
    }
    
    "CGVGButeneFinal"
    {
        $CGV
        tolerance       1e-8;
        relTol          0;
    }

}

PIMPLE
{
    momentumPredictor   yes;
    nOuterCorrectors    1;
    nCorrectors         3;
    nNonOrthogonalCorrectors 0;
    pRefCell            0;
    pRefValue           0;
    correctPhi          yes;
}

relaxationFactors
{
    equations
    {
        ".*"            1;
    }
}


// ************************************************************************* //
